# new_file

이름 = "개"
나이 = '6'
def 동물만들기(이름, 나이):
    만들이름 = 이름
    만들나이 = 나이
    print(만들이름)
    print(만들나이)

print(이름)

동물만들기('고양이', 3)

#쉽게 편집하기 핸들링 연습하기입니다.

# 버스타기 = "내집"
# 버스내리기 = "은하수네거리"

# 편의점가기 = "CU"
# 오라클빌딩도착하기 = "횡단보도"
# 삼층도착하기 = "계단"
# 강의실도착하기 = '집'
# 내자리앉기 = '강의실305호'

class room:
    def __init__(roomname, 의자, 모니터):
        roomname.의자 = 의자
        roomname.모니터 = 모니터

room305 = room("의자B", "모니터3")
print(f"의자: {room305.의자}")
print(f"모니터: {room305.모니터}")

room305.의자 = "의자C"

print(f"변경된 의자: {room305.의자}")

# 쇼핑몰 만들 거야.
로그인 = '로그인'
장바구니 = '장바구니등록'
찜 = '찜하기'
마이페이지 = '마이페이지'
포인트 = '마일리지'

제품수량 = '제품 수량'
구매 = '구매하기'
결제 = '결제하기'
택배연동 = '택배 연동'
구매기록 = '제품구매 기록'
평점 = '평점 남기기'

검색하기 = '검색'
제품카테고리 = '카테고리'

판매 = '판매등록'
바람잡기 = '광고'

커뮤니티 = '커뮤니티'
사진영상 = '사진과영상 업로드'

우리매장주소 = '매장주소'
회원탈퇴 = '회원탈퇴'
고객센터 = '고객센터 연락처'

